samples/error-examples.xml

<!-- ============================================================
     ShapeTool SOAP Web Service - ERROR EXAMPLES
     These examples demonstrate the improved descriptive error messages
     ============================================================ -->


<!-- ERROR 1: Negative radius -->
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gen="http://www.shapetool.com/gen">
   <soapenv:Header/>
   <soapenv:Body>
      <gen:circleAreaRequest>
         <gen:radius>-5.0</gen:radius>
      </gen:circleAreaRequest>
   </soapenv:Body>
</soapenv:Envelope>

<!-- Expected SOAP Fault Response for ERROR 1 -->
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
   <SOAP-ENV:Header/>
   <SOAP-ENV:Body>
      <SOAP-ENV:Fault>
         <faultcode>SOAP-ENV:Client</faultcode>
         <faultstring xml:lang="en">radius must be positive (greater than 0). Provided value: -5.0</faultstring>
         <detail>
            <ns2:field xmlns:ns2="http://www.shapetool.com/gen">radius</ns2:field>
            <ns2:errorMessage xmlns:ns2="http://www.shapetool.com/gen">radius must be positive (greater than 0). Provided value: -5.0</ns2:errorMessage>
         </detail>
      </SOAP-ENV:Fault>
   </SOAP-ENV:Body>
</SOAP-ENV:Envelope>


<!-- ERROR 2: Zero value for square side -->
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gen="http://www.shapetool.com/gen">
   <soapenv:Header/>
   <soapenv:Body>
      <gen:squareAreaRequest>
         <gen:side>0.0</gen:side>
      </gen:squareAreaRequest>
   </soapenv:Body>
</soapenv:Envelope>

<!-- Expected SOAP Fault Response for ERROR 2 -->
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
   <SOAP-ENV:Header/>
   <SOAP-ENV:Body>
      <SOAP-ENV:Fault>
         <faultcode>SOAP-ENV:Client</faultcode>
         <faultstring xml:lang="en">side must be positive (greater than 0). Provided value: 0.0</faultstring>
         <detail>
            <ns2:field xmlns:ns2="http://www.shapetool.com/gen">side</ns2:field>
            <ns2:errorMessage xmlns:ns2="http://www.shapetool.com/gen">side must be positive (greater than 0). Provided value: 0.0</ns2:errorMessage>
         </detail>
      </SOAP-ENV:Fault>
   </SOAP-ENV:Body>
</SOAP-ENV:Envelope>


<!-- ERROR 3: Negative length in rectangle -->
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gen="http://www.shapetool.com/gen">
   <soapenv:Header/>
   <soapenv:Body>
      <gen:rectangleAreaRequest>
         <gen:length>-10.0</gen:length>
         <gen:width>5.0</gen:width>
      </gen:rectangleAreaRequest>
   </soapenv:Body>
</soapenv:Envelope>

<!-- Expected SOAP Fault Response for ERROR 3 -->
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
   <SOAP-ENV:Header/>
   <SOAP-ENV:Body>
      <SOAP-ENV:Fault>
         <faultcode>SOAP-ENV:Client</faultcode>
         <faultstring xml:lang="en">length must be positive (greater than 0). Provided value: -10.0</faultstring>
         <detail>
            <ns2:field xmlns:ns2="http://www.shapetool.com/gen">length</ns2:field>
            <ns2:errorMessage xmlns:ns2="http://www.shapetool.com/gen">length must be positive (greater than 0). Provided value: -10.0</ns2:errorMessage>
         </detail>
      </SOAP-ENV:Fault>
   </SOAP-ENV:Body>
</SOAP-ENV:Envelope>


<!-- ERROR 4: Zero height in triangle -->
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gen="http://www.shapetool.com/gen">
   <soapenv:Header/>
   <soapenv:Body>
      <gen:triangleAreaRequest>
         <gen:base>12.0</gen:base>
         <gen:height>0.0</gen:height>
      </gen:triangleAreaRequest>
   </soapenv:Body>
</soapenv:Envelope>

<!-- Expected SOAP Fault Response for ERROR 4 -->
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
   <SOAP-ENV:Header/>
   <SOAP-ENV:Body>
      <SOAP-ENV:Fault>
         <faultcode>SOAP-ENV:Client</faultcode>
         <faultstring xml:lang="en">height must be positive (greater than 0). Provided value: 0.0</faultstring>
         <detail>
            <ns2:field xmlns:ns2="http://www.shapetool.com/gen">height</ns2:field>
            <ns2:errorMessage xmlns:ns2="http://www.shapetool.com/gen">height must be positive (greater than 0). Provided value: 0.0</ns2:errorMessage>
         </detail>
      </SOAP-ENV:Fault>
   </SOAP-ENV:Body>
</SOAP-ENV:Envelope>


<!-- ERROR 5: Negative base in parallelogram -->
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gen="http://www.shapetool.com/gen">
   <soapenv:Header/>
   <soapenv:Body>
      <gen:parallelogramAreaRequest>
         <gen:base>-8.0</gen:base>
         <gen:height>6.0</gen:height>
      </gen:parallelogramAreaRequest>
   </soapenv:Body>
</soapenv:Envelope>

<!-- Expected SOAP Fault Response for ERROR 5 -->
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
   <SOAP-ENV:Header/>
   <SOAP-ENV:Body>
      <SOAP-ENV:Fault>
         <faultcode>SOAP-ENV:Client</faultcode>
         <faultstring xml:lang="en">base must be positive (greater than 0). Provided value: -8.0</faultstring>
         <detail>
            <ns2:field xmlns:ns2="http://www.shapetool.com/gen">base</ns2:field>
            <ns2:errorMessage xmlns:ns2="http://www.shapetool.com/gen">base must be positive (greater than 0). Provided value: -8.0</ns2:errorMessage>
         </detail>
      </SOAP-ENV:Fault>
   </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
